Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldProcessTypeEnum Enumeration
 The weld process type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldProcessTypeEnum
Public Enumeration WeldProcessTypeEnum
Members
Member name | Value | Description
WELD_PROCESS_NONE | 0 |  No process type.
WELD_PROCESS_SMAW | 1 |  The shielded metal arc (SMAW) process type.
WELD_PROCESS_SAW | 2 |  The submerged arc (SAW) process type.
WELD_PROCESS_GMAW | 3 |  The gas metal arc (GMAW) process type.
WELD_PROCESS_FCAW | 4 |  The flux cored arc (FCAW) process type.
WELD_PROCESS_ESW | 5 |  The electroslag (ESW) process type.
WELD_PROCESS_EGW | 6 |  The electrogas (EGW) process type.
See Also
Reference
Tekla.Structures.Model Namespace